Revit 2027 API
BuiltInFailures.EditingFailures.InvalidElemsInSelection Property
 Can't scale elements together.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId InvalidElemsInSelection { get; }
Public Shared ReadOnly Property InvalidElemsInSelection As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ InvalidElemsInSelection {
	FailureDefinitionId^ get ();
}
static member InvalidElemsInSelection : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.EditingFailures Class
Autodesk.Revit.DB Namespace